docs/site/rogers04_teach_approac_music_theor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rogers04_teach_approac_music_theor</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">rogers04_teach_approac_music_theor</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0f33371">Teaching Approaches to Music Theory</a>
<ul>
<li><a href="#orgb7b73a1">Chapter 1</a></li>
<li><a href="#orgef5a967">Chapter 2</a></li>
<li><a href="#orge9faf8b">Chapter 3 Mind Training</a>
<ul>
<li><a href="#org8966a5f">Presenting New Material</a></li>
</ul>
</li>
<li><a href="#org5774543">Chapter 4</a></li>
<li><a href="#org860e4ef">Chapter 5</a></li>
<li><a href="#org1b0440c">Chapter 6 Teaching Techniques</a>
<ul>
<li><a href="#org675bda4">Teaching versus Learning</a></li>
</ul>
</li>
<li><a href="#orgd6c947d">Chapter 7 Evaluation and Curriculum Design</a>
<ul>
<li><a href="#org5386221">Testing and Grading</a></li>
<li><a href="#orgd993af2">Organization of a theory program</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0f33371" class="outline-2">
<h2 id="org0f33371">Teaching Approaches to Music Theory</h2>
<div class="outline-text-2" id="text-org0f33371">
</div>
<div id="outline-container-orgb7b73a1" class="outline-3">
<h3 id="orgb7b73a1">Chapter 1</h3>
<div class="outline-text-3" id="text-orgb7b73a1">
<p>
Scales, do-re-mi, roman numerals, and key signatures are no more a study of music than the alphabet, verbs, commas, etc. are studying literature. It is more pretheory. (pg 3)
All to often the terminology, labels, etc. take the entirety of music theory curriculum and it never gets applied. It's an introduction that runs out just at the wrong time. (pg 4)
One of the goals should be to discover what questions about music are worth asking in the first place. (pg 5)
Too often we teach with right-or-wrong exercises. We don't allow for creative thinking. It's too black and white. (pg 5)
Just because "correct" answers are hard or impossible to find, doesn't mean we should shy away from grappling with those questions. (pg 7)
Music theory is more of an activity like composition or performance, and less like a subject to learn. (pg 7)
thinking and listening are inseperable in theorizing (pg 8)
The urge to teach inside the box, black and white, right or wrong—because it makes our job easy—should be resisted at all costs. (pg 14)
</p>
</div>
</div>
<div id="outline-container-orgef5a967" class="outline-3">
<h3 id="orgef5a967">Chapter 2</h3>
</div>
<div id="outline-container-orge9faf8b" class="outline-3">
<h3 id="orge9faf8b">Chapter 3 Mind Training</h3>
<div class="outline-text-3" id="text-orge9faf8b">
</div>
<div id="outline-container-org8966a5f" class="outline-4">
<h4 id="org8966a5f">Presenting New Material</h4>
<div class="outline-text-4" id="text-org8966a5f">
<p>
Try and present new topics as an offshoot, variant, or relative of another. Stress similarities as much as differences.
Examples:
</p>
<ul class="org-ul">
<li>Modulation vs secondary dominants (very similar processes, just more local vs global)</li>
<li>N^6 vs IV (very similar in pitches, function, etc.)</li>
<li>Anticipation vs suspension (both a temporal adjustment, both changing the goal, both have a dissonance and resolution)</li>
</ul>

<p>
This also builds review into a course, as everything is put in the context of what they already know. (pg 57)
Try to keep the essence simple, avoid overcomplicating things too early. For example, passing tones are simple, but listing 10-12 different types of passing tones is not good at the beginning. (pg 59)
Make sure to not skip over steps just because we are good at it, because the students may not be. If a student is struggling, keep breaking things into previous steps until there is some level of comprehension, then build from there. (pg 60)
Sometimes it is necessary to have a class or lecture that ties in topics that have been studied individually into one whole (pg 64)
</p>
</div>
</div>
</div>
<div id="outline-container-org5774543" class="outline-3">
<h3 id="org5774543">Chapter 4</h3>
</div>
<div id="outline-container-org860e4ef" class="outline-3">
<h3 id="org860e4ef">Chapter 5</h3>
</div>
<div id="outline-container-org1b0440c" class="outline-3">
<h3 id="org1b0440c">Chapter 6 Teaching Techniques</h3>
<div class="outline-text-3" id="text-org1b0440c">
<ol class="org-ol">
<li>The single most important thing when teaching new material is to relate the strange to the familiar. Spiral learning and disguised repetition are easy to do in music theory</li>
<li>Distinguish between core essential concepts and peripheral material must be made. Student can't sort through this unless distinctions are made.</li>
<li>Assume only the student's background knowledge. Try to think what it will be like to learn things for the first time. Our job is to fool students into seeing that theory is simpler than they think it is</li>
<li>Present new material in a way that sets the stage for the next topic. Everything fits into a single continuum</li>
<li>Principles of programmed instruction (steps to solve a problem I think?) can be used in any theory course. Try and shift diagnosis of errors from teacher to student, let them figure out their mistakes. Are they careless? Wrong clef? Working too fast? Too slow? Not considering alternatives? Not understanding current topic? Lack of previous assumed knowledge?</li>
<li>Preparation and organization. Very few can consistently wing it. Make written notes for each class. Plan more activities than there is time for, as some things go quicker than anticipated. Stuff that isn't used can give continuity in the next class. Changing topics or approaches every 10-15 minutes is a good balance. Don't just spell things for the whole class period.</li>
<li>Verbally express high expectations. Students tend to live up to standards and hopes that are instilled in the classroom atmosphere.</li>
<li>Any improvements to physical classroom space should be taken advantage of. Temperature, air, light, windows, background sounds, speaker placement, seating arrangements</li>
<li>Students should be actively engaged as much as possible</li>
<li>Analysis and listening should reinforce each other</li>
<li>Multifaceted approaches are best for most teachers. It increases the chances for students to find what works for them.</li>
<li>Use students in teaching</li>
<li>Distinguish between drilling and teaching. Try and drill just enough so students know how to drill on their own. Let most of that happen outside of class</li>
<li>A review at the beginning of a new course or new year is often good.</li>
<li>Make minor adjustments, new pieces, etc to keep the course fresh. Don't try every single fad, that can be as disruptive as changing applied teachers every semester.</li>
<li>Computers can be helpful, but don't replace teaching. Computers are very good at what is least important in music theory, and not great at what is important. Computers can't really teach, they can only test.</li>
</ol>
<p>
(pages 153-161)
</p>
</div>
<div id="outline-container-org675bda4" class="outline-4">
<h4 id="org675bda4">Teaching versus Learning</h4>
<div class="outline-text-4" id="text-org675bda4">
<p>
Group dynamics and communication are important, perhaps more than we like to admit.
</p>

<p>
Classes normally have three phsycological stages:
</p>
<ol class="org-ol">
<li>Dependency stage - first two or three weeks of the semester.</li>
<li>Affiliative stage - middle ten weeks</li>
<li>Closure stage - last 2-3 weeks</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd6c947d" class="outline-3">
<h3 id="orgd6c947d">Chapter 7 Evaluation and Curriculum Design</h3>
<div class="outline-text-3" id="text-orgd6c947d">
</div>
<div id="outline-container-org5386221" class="outline-4">
<h4 id="org5386221">Testing and Grading</h4>
<div class="outline-text-4" id="text-org5386221">
<p>
Suggestions for a valuable test:
</p>
<ol class="org-ol">
<li>Both fair and challenging. This is one of the hardest parts</li>
<li>Specifying content, length, difficulty level, etc. in advance increases the likelihood of study and preparation. Practice tests are often valued by students.</li>
<li>Lots of shorter tests are best so no single score is over-weighted. This is especially true in ear-training courses.</li>
<li>A variety of difficulty levels within the exam hel0p to spread scores appropriately (avoiding too many As or Fs). It is wise to start with some easy questions everyone can get to boost confidence. It's also wise to have a couple really hard questions to extend the strong students</li>
<li>Have students construct exams as well as take them.</li>
<li>Feedback (quick if possible) and review of test questions is important.</li>
<li>You can be creative and imaginative in test questions as much as other areas of teaching. Again, watch for only testing things easy to grade</li>
<li>Judging length is one of the harder things to do. Can have differences of speed tests and power tests</li>
<li>Distinctions should be made among domains of thinking to be tested. Mix subjective vs objective, sort answer, essay, symbols, facts, opinions, skills</li>
<li>Reliability and validity. Do repeated measures yield similar and consistent results? Does the test measure what it claims to measure?</li>
<li>Some pass/fail exams with high thresholds and very specific factual information can be helpful (an example is key signatures)</li>
<li>Self administered or self paced exams can be good in environments that allow for them</li>
<li>Distinctions between aptitude and achievement is complex but can be helpful in designing formats</li>
<li>Grading schemes is difficult. Percentage based, curve based, or contract based (meaning if you get to a certain level, you get an A. Is this like a rubric?)</li>
<li>Make sure whatever you do is clearly designed and stated in the syllabus</li>
<li>Teaching just for exams is a dangerous routine. Many of the most important goals can't be tested at all. Shouldn't be taken too seriously, but still get all the value and effort it needs</li>
</ol>
<p>
(pages 166-169)
</p>
</div>
</div>
<div id="outline-container-orgd993af2" class="outline-4">
<h4 id="orgd993af2">Organization of a theory program</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
